Revit 2027 API
KeyBasedTreeEntriesLoadContent Properties
The KeyBasedTreeEntriesLoadContent type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ExternalResourceLoadContent)
LoadStatus |  A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.
(Inherited from ExternalResourceLoadContent)
Version |  The version of the external data that the server is providing in this object.
(Inherited from ExternalResourceLoadContent)
Top
See Also
Reference
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace